In [2]:
import pandas as pd
from pandas import Series, DataFrame

#pd.set_option('max_columns', 8, 'max_rows', 8)

In [5]:
def f2(x, y):
    return x+y

def f(k, **kwargs):
    print(kwargs)
    return f2(**kwargs) # => f2(x=3, y=4)

kwargs = {'x':5,'y':9}

f(**kwargs)   # 변수 선언 된 것만 고치면 된다.

{'x': 3, 'y': 4}

7

Data wrangling, sometimes referred to as a data munging, is the process of transforming and mapping data from one "raw" data form into another format with the intent of making it more appropriate and valuable for a variety of downstream purposes such as analytics.
Pandas

<font color = "#CC3D3D"><p>
# Topics
* [DataFrame: anatomy, important attributes & methods, and data types](#DataFrame:-anatomy,-important-attributes-&-methods,-and-data-types)
* [Series: a single column of data from a DataFrame](#Series:-a-single-column-of-data-from-a-DataFrame)
* [Summarizing Data](#Summarizing-Data)
* [Indexing and Slicing](#Indexing-and-Slicing)
* [Boolean Indexing](#Boolean-Indexing)

## DataFrame: anatomy, important attributes & methods, and data types
### What is a DataFrame?
- A DataFrame represents a tabular(중요한 데이터), spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric,string, boolean, etc.).
- The DataFrame has both a row(행) and column index.
- Compared with other such DataFrame-like structures you may have used before (like R’s data.frame), row-oriented and column-oriented operations in DataFrame are treated roughly symmetrically.   

DataFrame은 column, index, value로 구성
### Anatomy of a DataFrame
<img align="left" src="https://miro.medium.com/max/2000/1*aJJjpCHMNVyfM3UIJZyYcw.png">

In [14]:
movie = pd.read_csv('movie.csv')
movie

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [15]:
demo = pd.read_csv('Demo.csv', encoding='cp949')  # encoding 할 때는 한글 완성형 : cp949로 하는 게 좋다.
demo
# csv는 comma, separated value로써 콤마로 구분한다는 뜻이 존재. tsv는 tab, separated value의 약자이다.

             ID  성별  연령     거주지역
0     478207946   1  84   서울 성동구
1     479806984   1  84   서울 서초구
2      94790213   1  84   부산 사상구
3     656026338   1  84  서울 영등포구
4     433076833   1  83   경기 고양시
...         ...  ..  ..      ...
3537  154314532   1  66   부산 사하구
3538  416998709   1  59   경기 수원시
3539  168692065   2  63   경기 안양시
3540  955481370   2  58   경기 의왕시
3541  821581510   2  64   경기 안양시

[3542 rows x 4 columns]

In [16]:
tran = pd.read_csv('구매내역정보.csv', encoding='cp949', engine='python') # 파일명이 한글일 때 안 읽히는 경우가 생기는데 그 때는 engine = 'python'으로 하면 된다.
tran

,ID,상품대분류명,상품중분류명,구매지역,구매일자,구매시간,구매수량,구매금액,취소여부
0,410362886,의류잡화,여성용의류-정장류,서울 송파구,20140510,1,1,198000,0
1,643279402,식품,농산물,경기 성남시,20140612,1,1,2000,0
2,643279402,식품,농산물,경기 성남시,20140612,1,1,4000,0
3,643279402,식품,농산물,경기 성남시,20140612,1,1,5000,0
4,643279402,식품,농산물,경기 성남시,20140612,1,1,9000,0
...,...,...,...,...,...,...,...,...,...
101687,797822538,가전제품,휴대폰/태블릿,서울 중구,20140528,22,1,0,0
101688,797822538,가전제품,휴대폰/태블릿,서울 중구,20140528,22,1,9000,0
101689,862978930,레포츠,스포츠용품/의류,서울 강서구,20140817,22,1,88000,0
101690,968743249,가전제품,TV/AV,경기 성남시,20141031,22,1,2569000,0
101691,980881628,의류잡화,남성용의류-캐주얼,서울 중구,20140815,22,1,50000,0

In [7]:
data = {'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
        'year': [2014, 2016, 2018, 2014, 2016, 2018],
        'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
data
# 직접 dataframe을 만들고 싶으면 딕셔너리 이용하면 편하다. 가장 쉬운 방법. 만들 때 갯수가 맞아야 만들어진다.

{'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
 'year': [2014, 2016, 2018, 2014, 2016, 2018],
 'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}

In [8]:
df = DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

### Important Attributes and Methods
| Attributes or Methods | Results |
|:---|:---|
| df.index | Array-like row labels |
| df.columns | Array-like column labels |
| df.values | Numpy array, data |
| df.shape | (n_rows, m_cols) |
| df.dtypes | Type of each column |
| len(df) | Number of rows |
| df.head(), df.tail() | First/last rows |
| df.describe() | Summary stats |
| df.info() | Summary of a DF |

메소드는 함수 형태
attribute () 형태로 쓴다.

In [14]:
df.head(3) # tail보다 head를 더 많이 쓴다.

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [20]:
tran.head()

          ID 상품대분류명     상품중분류명    구매지역      구매일자  구매시간  구매수량    구매금액  취소여부
0  410362886   의류잡화  여성용의류-정장류  서울 송파구  20140510     1     1  198000     0
1  643279402     식품        농산물  경기 성남시  20140612     1     1    2000     0
2  643279402     식품        농산물  경기 성남시  20140612     1     1    4000     0
3  643279402     식품        농산물  경기 성남시  20140612     1     1    5000     0
4  643279402     식품        농산물  경기 성남시  20140612     1     1    9000     0

In [15]:
df.tail() # 뒤에서부터 몇개

  state  year    pop
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [23]:
set(df.index)  # index는 표의 행

{0, 1, 2, 3, 4, 5}

In [24]:
df.index.values # array는 numpy의 저장구조, 쉽게는 list 형태로 알아두면 될 것!

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [25]:
list(df.columns)

['state', 'year', 'pop']

In [26]:
df.values

array([['서울', 2014, 997.5],
       ['서울', 2016, 984.3],
       ['서울', 2018, 970.5],
       ['부산', 2014, 345.2],
       ['부산', 2016, 344.7],
       ['부산', 2018, 340.0]], dtype=object)

In [27]:
df.shape

(6, 3)

In [29]:
df.shape[0]

6

In [30]:
tran.shape

(101692, 9)

In [31]:
len(df) # n_rows  len보다 shpae를 더 많이 권장한다.

6

In [32]:
df.size # n_all_elements = n_rows * n_cols

18

### Data types
<img align="left" src="http://drive.google.com/uc?export=view&id=1x5GP26v8C5oUDB3RY2mADHLRf9K1WgDe">

- 첫 번째 column을 성별로 했으면 남,녀만 들어가야 하는데 숫자가 들어가면 안 된다.
- 한 column 안에는 같은 속성이어야 한다.
- 복소수까지 가능하다
- Object는 파이썬의 타입과 같은 역할
- 날짜와 관련된 것은 Datetime
- 시간까지 들어간 것은 Timedelta
- Categorical(범주화)

In [119]:
df

  state
0    서울
1    서울
2    서울
3    부산
4    부산
5    부산

In [120]:
df.dtypes # 문자열은 object

state    object
dtype: object

In [121]:
df.dtypes.value_counts()

object    1
dtype: int64

In [122]:
movie.dtypes.value_counts()  # movie.dtypes만 하면 각각의 타입이 다 나온다.

float64    13
object     12
int64       3
dtype: int64

In [123]:
df.info() # 정말 많이 쓰는 method

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   6 non-null      object
dtypes: object(1)
memory usage: 176.0+ bytes

In [37]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4916 entries, 0 to 4915
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      4897 non-null   object
 1   director_name              4814 non-null   object
 2   num_critic_for_reviews     4867 non-null   float64
 3   duration                   4901 non-null   float64
 4   director_facebook_likes    4814 non-null   float64
 5   actor_3_facebook_likes     4893 non-null   float64
 6   actor_2_name               4903 non-null   object
 7   actor_1_facebook_likes     4909 non-null   float64
 8   gross                      4054 non-null   float64
 9   genres                     4916 non-null   object
 10  actor_1_name               4909 non-null   object
 11  movie_title                4916 non-null   object
 12  num_voted_users            4916 non-null   int64
 13  cast_total_facebook_likes  4916 non-null   int64
 14  actor_3_name               4893 non-null   object
 15  facenumber_in_poster       4903 non-null   float64
 16  plot_keywords              4764 non-null   object
 17  movie_imdb_link            4916 non-null   object
 18  num_user_for_reviews       4895 non-null   float64
 19  language                   4904 non-null   object
 20  country                    4911 non-null   object
 21  content_rating             4616 non-null   object
 22  budget                     4432 non-null   float64
 23  title_year                 4810 non-null   float64
 24  actor_2_facebook_likes     4903 non-null   float64
 25  imdb_score                 4916 non-null   float64
 26  aspect_ratio               4590 non-null   float64
 27  movie_facebook_likes       4916 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [43]:
movie.describe() # DataFrame에 있는 숫자값이 들어간 column의 기술통계값이 들어간다.

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,num_voted_users,cast_total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
count,4867.000000,4901.000000,4814.000000,4893.000000,4909.000000,4.054000e+03,4.916000e+03,4916.000000,4903.000000,4895.000000,4.432000e+03,4810.000000,4903.000000,4916.000000,4590.000000,4916.000000
mean,137.988905,107.090798,691.014541,631.276313,6494.488491,4.764451e+07,8.264492e+04,9579.815907,1.377320,267.668846,3.654749e+07,2002.447609,1621.923516,6.437429,2.222349,7348.294142
std,120.239379,25.286015,2832.954125,1625.874802,15106.986884,6.737255e+07,1.383222e+05,18164.316990,2.023826,372.934839,1.002427e+08,12.453977,4011.299523,1.127802,1.402940,19206.016458
min,1.000000,7.000000,0.000000,0.000000,0.000000,1.620000e+02,5.000000e+00,0.000000,0.000000,1.000000,2.180000e+02,1916.000000,0.000000,1.600000,1.180000,0.000000
25%,49.000000,93.000000,7.000000,132.000000,607.000000,5.019656e+06,8.361750e+03,1394.750000,0.000000,64.000000,6.000000e+06,1999.000000,277.000000,5.800000,1.850000,0.000000
50%,108.000000,103.000000,48.000000,366.000000,982.000000,2.504396e+07,3.313250e+04,3049.000000,1.000000,153.000000,1.985000e+07,2005.000000,593.000000,6.600000,2.350000,159.000000
75%,191.000000,118.000000,189.750000,633.000000,11000.000000,6.110841e+07,9.377275e+04,13616.750000,2.000000,320.500000,4.300000e+07,2011.000000,912.000000,7.200000,2.350000,2000.000000
max,813.000000,511.000000,23000.000000,23000.000000,640000.000000,7.605058e+08,1.689764e+06,656730.000000,43.000000,5060.000000,4.200000e+09,2016.000000,137000.000000,9.500000,16.000000,349000.000000

In [46]:
# pandas 데이터 타입을 변경하려면 astype 메소드를 사용할 것: 인자로 pandas string name 지정
df.describe().astype('int') # 소수점 안 보고 싶은 경우 이렇게 형태 변경 가능하다.

       year  pop
count     6    6
mean   2016  663
std       1  351
min    2014  340
25%    2014  344
50%    2016  657
75%    2017  980
max    2018  997

## Series: a single column of data from a DataFrame

In [13]:
dir(pd.read_csv('movie.csv').director_name)#.index.values # 뒤에 .director_name을 날리면 처음에 봤던 코드. 하나의 Series를 보기 위해 실행
# Series를 볼 때 이름하고 길이하고 dtype을 알 수 있다. dir은 사용할 수 있는 메소드를 알 수 있다.

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_box_item_values',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_convert_dtypes',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_type',
 '_find_valid_index',
 '_from_axes',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_iget_item_cache',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_ndarray_values',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_labels',
 '_set_name',
 '_set_subtyp',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_series_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [15]:
df.state # 특정한 column을 뽑고 싶을 때 .찍고 원하는 column 쓰면 된다.

0    서울
1    서울
2    서울
3    부산
4    부산
5    부산
Name: state, dtype: object

In [16]:
df[['state', 'pop']]  # 두 개 이상의 column을 뽑고 싶을 때, 대괄호 두 번 써서 사용하면 된다. Series가 아니라 DataFrame이다.

  state    pop
0    서울  997.5
1    서울  984.3
2    서울  970.5
3    부산  345.2
4    부산  344.7
5    부산  340.0

In [23]:
df.pop # df에 pop이라는 메소드가 존재해서 pop이라는 Series와 충돌된다. 그러므로, Series의 pop을 갖고 오고 싶으면 밑에 코드처럼 하면 된다.

<bound method NDFrame.pop of   state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0>

In [30]:
df['state'].value_counts() # Series 하나만 데이터를 갖고 오고 싶을 땐 대괄호 한 번만 하면 된다. 값 범주별로 몇 개씩 나왔는지 알려준다.

부산    3
서울    3
Name: state, dtype: int64

In [32]:
df[['state']]#.value_counts() # 대괄호 두번 써서 리스트로 쓰게 되면 결과값은 DataFrame이다. DataFrame에는 .value_counts()라는 메소드가 존재하지 않는다.

  state
0    서울
1    서울
2    서울
3    부산
4    부산
5    부산

In [33]:
type(df.state), type(df)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [49]:
df.state.value_counts()

부산    3
서울    3
Name: state, dtype: int64

In [46]:
# 구매기록으로부터 가장 적게 팔리는 상품 5가지를 찾아라.
tran.상품대분류명.value_counts().index[-5:] # 이 메소드의 장점은 자동적으로 sorting 한다.

Index(['가전제품', '생활잡화', '레포츠', '명품', '가구'], dtype='object')

In [47]:
df.state.size # Series 갯수

6

In [50]:
df.state.value_counts().size

2

In [51]:
df.state.unique()

array(['서울', '부산'], dtype=object)

In [53]:
tran.상품대분류명.unique()

array(['의류잡화', '식품', '가전제품', '레포츠', '생활잡화', '가구', '명품'], dtype=object)

In [55]:
tran.상품중분류명.nunique() # 갯수 파악

31

In [56]:
df.state.nunique()

2

In [57]:
df.state.size == len(df.state)

True

In [58]:
df.state.shape

(6,)

In [62]:
df.state.min()

'부산'

In [60]:
df.state.isnull() #isnull은 결측값이 있는지 없는지 확인

0    False
1    False
2    False
3    False
4    False
5    False
Name: state, dtype: bool

In [66]:
movie.color.isnull().sum() # 이 결과값도 Series로 도출된다. .sum()까지 하면 결측값 갯수가 총 19개라는 결과가 나온다.

19

In [67]:
movie.isnull().sum()

color                         19
director_name                102
num_critic_for_reviews        49
duration                      15
director_facebook_likes      102
actor_3_facebook_likes        23
actor_2_name                  13
actor_1_facebook_likes         7
gross                        862
genres                         0
actor_1_name                   7
movie_title                    0
num_voted_users                0
cast_total_facebook_likes      0
actor_3_name                  23
facenumber_in_poster          13
plot_keywords                152
movie_imdb_link                0
num_user_for_reviews          21
language                      12
country                        5
content_rating               300
budget                       484
title_year                   106
actor_2_facebook_likes        13
imdb_score                     0
aspect_ratio                 326
movie_facebook_likes           0
dtype: int64

In [69]:
df.year.isin([2014, 2015, 2016]).sum()

4

In [70]:
state_pop = df['pop']; state_pop

0    997.5
1    984.3
2    970.5
3    345.2
4    344.7
5    340.0
Name: pop, dtype: float64

In [73]:
state_pop + 1 # element-wise operation. 연산자 다 가능

0    998.5
1    985.3
2    971.5
3    346.2
4    345.7
5    341.0
Name: pop, dtype: float64

In [72]:
[1,2,3] + 1 # 리스트에는 더하기 정수는 안됨. But, pandas의 Series는 가능하다. 각각의 원소에 더하기가 가능.

TypeError: can only concatenate list (not "int") to list

In [77]:
state_pop > 500

0     True
1     True
2     True
3    False
4    False
5    False
Name: pop, dtype: bool

In [ ]:
state_pop.add(1) # add, sub, mul, div, floordiv, mod, pow

In [79]:
state_pop.pow(2)

0    995006.25
1    968846.49
2    941870.25
3    119163.04
4    118818.09
5    115600.00
Name: pop, dtype: float64

In [85]:
state_pop.add(1).sub(2).mul(3).div(6)
# 메소드 체이닝 장점 : 순서대로 계산을 해주기 때문에 밑에 있는 연산자 우선순위에 관계없이 순서대로 진행하면 된다.

0    498.25
1    491.65
2    484.75
3    172.10
4    171.85
5    169.50
Name: pop, dtype: float64

In [84]:
(state_pop + 1 - 2) * 3 / 6

0    498.25
1    491.65
2    484.75
3    172.10
4    171.85
5    169.50
Name: pop, dtype: float64

In [ ]:
state_pop.gt(500) # lt, gt, le, ge, eq, ne

In [89]:
(((state_pop + 1) * 2) // 3).sum()

2655.0

In [88]:
state_pop.add(1).mul(2).floordiv(3).sum()

2655.0

<font color='blue'><p>
==> The sequential invocation of methods using the dot notation is referred to as **method chaining**.

In [87]:
(state_pop / state_pop.sum()).sum()

0.9999999999999999

axis는 축
그래프에서 y축이 행 ,x축이 열

## Summarizing Data
<img align="left" src="http://drive.google.com/uc?export=view&id=16CeMSPNyCjyICq_KlJm7ERWNoJfKwgZo">
<img align="left" src="http://drive.google.com/uc?export=view&id=1eCA7rRFojxc7WIG7xrVasuCbWuoY2KGT">

In [18]:
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [91]:
df.min()

state      부산
year     2014
pop       340
dtype: object

In [92]:
df.min(axis=0)

state      부산
year     2014
pop       340
dtype: object

In [93]:
df.min(axis=1)

0    997.5
1    984.3
2    970.5
3    345.2
4    344.7
5    340.0
dtype: float64

In [94]:
df.sum()

state    서울서울서울부산부산부산
year            12096
pop            3982.2
dtype: object

In [95]:
df.count() # no. of non-null observations

state    6
year     6
pop      6
dtype: int64

In [96]:
df.quantile(q=0.5) # 4분위수로 판단함. 0.25, 0.5 , 0.75

year    2016.00
pop      657.85
Name: 0.5, dtype: float64

In [99]:
pd.__version__

'1.0.1'

In [101]:
x = df

In [103]:
del df['year']
df

  state    pop
0    서울  997.5
1    서울  984.3
2    서울  970.5
3    부산  345.2
4    부산  344.7
5    부산  340.0

In [104]:
x # df['year']하기 전에 x에 df를 넣었다. 하지만 지금 x를 코딩하면 year 부분이 사라졌다.

  state    pop
0    서울  997.5
1    서울  984.3
2    서울  970.5
3    부산  345.2
4    부산  344.7
5    부산  340.0

In [106]:
y = df.copy()

In [109]:
del df['pop']
df

KeyError: 'pop'

In [110]:
y # y = df랑 동일시 하지 않고 복사하고 진행해야 df와 y가 분리된다. .copy()가 없을 경우 동일시 되어서 진행한다.

  state    pop
0    서울  997.5
1    서울  984.3
2    서울  970.5
3    부산  345.2
4    부산  344.7
5    부산  340.0

In [97]:
# DataFrame 변수를 assign할 때 (즉, df2 = df1), 주소(address)가 복사되고 내용은 복사되지 않음.
# 따라서, 원 데이터는 그대로 보존하면서 DataFrame 변수의 내용을 다른 변수에 복사할 경우 copy 메소드를 사용할 것 !
dx = df.copy()
display(dx)
dy = dx
dx.iloc[1,1] = pd.NA  # use pd.NA or NumPy NaN (np.nan) to represent a missing value.
display(dx)
display(dy)
display(df)
del dx, dy

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

  state  year    pop
0    서울  2014  997.5
1    서울  <NA>  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

  state  year    pop
0    서울  2014  997.5
1    서울  <NA>  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [117]:
%whos

Variable    Type         Data/Info
----------------------------------
DataFrame   type         <class 'pandas.core.frame.DataFrame'>
Series      type         <class 'pandas.core.series.Series'>
data        dict         n=3
demo        DataFrame                 ID  성별  연령  <...>\n[3542 rows x 4 columns]
df          DataFrame      state\n0    서울\n1    서울<...>3    부산\n4    부산\n5    부산
movie       DataFrame          color      director<...>n[4916 rows x 28 columns]
pd          module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
state_pop   Series       0    997.5\n1    984.3\n2<...>Name: pop, dtype: float64
tran        DataFrame                   ID 상품대분류명 <...>[101692 rows x 9 columns]
x           DataFrame      state\n0    서울\n1    서울<...>3    부산\n4    부산\n5    부산
y           DataFrame      state    pop\n0    서울  <...>부산  344.7\n5    부산  340.0

## Indexing and Slicing
<img src='http://drive.google.com/uc?export=view&id=1eyYiZP5xQr5M6IIw9lnKjoAYY1m4YmiI'>

<font color='blue'>some rows (all columns in a DataFrame)
    
indexing : 몇 번 째 열부터 몇번째 열까지 뽑는 것
slicing : 몇 번 째 열부터 몇 번째 열까지 자르는 것
리스트에 비해서 한 차원 더 높은 것
    
.loc은 이름으로 지정
.iloc은 숫자로 지정
    
pandas의 가장 단점은? : 옵션(동일한 결과를 얻을 수 있는 코드가 너무 다양하다)이 너무 많다.

In [11]:
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [9]:
df.iloc[0]
# df.loc[0]

# df.iloc[0] #

state       서울
year      2014
pop      997.5
Name: 0, dtype: object

In [10]:
df.loc[1:3]

  state  year    pop
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2

In [134]:
df.iloc[1:3]

  state  year    pop
1    서울  2016  984.3
2    서울  2018  970.5

In [136]:
df.iloc[:1]

  state  year    pop
0    서울  2014  997.5

<font color='blue'>All rows, some columns

In [137]:
df.loc[:,'state'] # df.loc['state'] 으로 쓰면 행으로 들어가서 열로 들어가지 않는다. 약식은 초반에 안 쓰는 게 좋다. 헷갈리기 쉽다.
df.iloc[:,0]

df.state
df['state']

0    서울
1    서울
2    서울
3    부산
4    부산
5    부산
Name: state, dtype: object

In [138]:
df.loc[:,'state':'pop']
#df[['state','pop']]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [12]:
df.iloc[:,0:3]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [142]:
df.loc[:, -'pop']

TypeError: bad operand type for unary -: 'str'

In [141]:
df.iloc[:, -2] # iloc은 뒤에서부터 하는 게 가능.

0    2014
1    2016
2    2018
3    2014
4    2016
5    2018
Name: year, dtype: int64

In [143]:
df.loc[:,['year','pop']]

   year    pop
0  2014  997.5
1  2016  984.3
2  2018  970.5
3  2014  345.2
4  2016  344.7
5  2018  340.0

<font color='blue'>Subset of rows and columns

In [144]:
df.loc[1, 'pop']

984.3

In [145]:
df.loc[0:2, ['state', 'year']]

  state  year
0    서울  2014
1    서울  2016
2    서울  2018

In [146]:
df.loc[:,:]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

## Boolean Indexing

In [147]:
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [148]:
df.query('pop > 500') # column명 넣고 조건을 달아서 진행

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [150]:
df.query('pop > pop.mean()')[['year', 'pop']] # pop필드 값 중에서 평균 이상을 뽑아라

   year    pop
0  2014  997.5
1  2016  984.3
2  2018  970.5

In [152]:
df.query('year in [2014, 2016] and state == "부산"') # .query할 때 주의 점 : 문자열로 묶어야 한다.

  state  year    pop
3    부산  2014  345.2
4    부산  2016  344.7

In [153]:
df[df['pop'] > 500]

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5

In [154]:
df['pop'] > 500

0     True
1     True
2     True
3    False
4    False
5    False
Name: pop, dtype: bool

<font color = "blue"><p>
## Exercises

**Exercise 26**: Select the first row of data (the first record) from `movie`.

In [17]:
movie

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [157]:
movie.iloc[0,:]

color                                                                    Color
director_name                                                    James Cameron
num_critic_for_reviews                                                     723
duration                                                                   178
director_facebook_likes                                                      0
actor_3_facebook_likes                                                     855
actor_2_name                                                  Joel David Moore
actor_1_facebook_likes                                                    1000
gross                                                              7.60506e+08
genres                                         Action|Adventure|Fantasy|Sci-Fi
actor_1_name                                                       CCH Pounder
movie_title                                                             Avatar
num_voted_users                                                         886204
cast_total_facebook_likes                                                 4834
actor_3_name                                                         Wes Studi
facenumber_in_poster                                                         0
plot_keywords                           avatar|future|marine|native|paraplegic
movie_imdb_link              http://www.imdb.com/title/tt0499549/?ref_=fn_t...
num_user_for_reviews                                                      3054
language                                                               English
country                                                                    USA
content_rating                                                           PG-13
budget                                                                2.37e+08
title_year                                                                2009
actor_2_facebook_likes                                                     936
imdb_score                                                                 7.9
aspect_ratio                                                              1.78
movie_facebook_likes                                                     33000
Name: 0, dtype: object

**Exercise 27**: Select the first 10 values from the `director_name` column in `movie`.

In [158]:
movie.director_name[:10]

0        James Cameron
1       Gore Verbinski
2           Sam Mendes
3    Christopher Nolan
4          Doug Walker
5       Andrew Stanton
6            Sam Raimi
7         Nathan Greno
8          Joss Whedon
9          David Yates
Name: director_name, dtype: object

In [159]:
movie.iloc[:10, 1]

0        James Cameron
1       Gore Verbinski
2           Sam Mendes
3    Christopher Nolan
4          Doug Walker
5       Andrew Stanton
6            Sam Raimi
7         Nathan Greno
8          Joss Whedon
9          David Yates
Name: director_name, dtype: object

In [161]:
movie.loc[:9, 'director_name']

0        James Cameron
1       Gore Verbinski
2           Sam Mendes
3    Christopher Nolan
4          Doug Walker
5       Andrew Stanton
6            Sam Raimi
7         Nathan Greno
8          Joss Whedon
9          David Yates
Name: director_name, dtype: object

**Exercise 28**: Select the `country` and `budget` columns of the first 101 records.

In [168]:
movie[['country','budget']].iloc[:101]

    country       budget
0       USA  237000000.0
1       USA  300000000.0
2        UK  245000000.0
3       USA  250000000.0
4       NaN          NaN
..      ...          ...
96      USA  165000000.0
97      USA  160000000.0
98    Japan          NaN
99      USA  180000000.0
100     USA   38000000.0

[101 rows x 2 columns]

**Exercise 29**: Select the `imdb_score` column for the last 1000 movies.

In [173]:
movie.iloc[-1000:].imdb_score

3916    6.8
3917    3.9
3918    6.1
3919    7.5
3920    8.2
       ...
4911    7.7
4912    7.5
4913    6.3
4914    6.3
4915    6.6
Name: imdb_score, Length: 1000, dtype: float64

**Exercise 30**: Select movies made in `South Korea`. Hint: `movie.country` equals what?

In [176]:
movie.query("country == 'South Korea'")

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
1063,Color,Terence Young,10.0,140.0,92.0,522.0,Ben Gazzara,1000.0,NaN,Drama|History|War,...,16.0,English,South Korea,PG,4.800000e+07,1981.0,623.0,2.7,2.35,115
1313,Color,Joon-ho Bong,488.0,126.0,584.0,398.0,Ewen Bremner,11000.0,4563029.0,Action|Drama|Sci-Fi|Thriller,...,514.0,English,South Korea,R,3.920000e+07,2013.0,557.0,7.0,1.85,58000
1549,Color,Hyung-rae Shim,93.0,107.0,26.0,535.0,Aimee Garcia,889.0,10956379.0,Action|Drama|Fantasy|Horror|Thriller,...,364.0,English,South Korea,PG-13,3.500000e+07,2007.0,618.0,3.6,2.35,0
2576,Color,JK Youn,43.0,103.0,2.0,13.0,Ji-won Ha,94.0,NaN,Action|Comedy|Drama|Thriller,...,25.0,Korean,South Korea,R,NaN,2009.0,80.0,5.7,2.35,558
2788,Color,Hyung-rae Shim,4.0,100.0,26.0,385.0,Stephanie Danielson,898.0,163591.0,Comedy,...,17.0,English,South Korea,PG-13,1.340000e+07,2010.0,391.0,3.6,1.78,502
2845,Color,John H. Lee,2.0,115.0,32.0,29.0,Dean Dawson,14000.0,31662.0,Action|Drama|History|War,...,1.0,English,South Korea,NaN,1.262000e+07,2016.0,81.0,6.8,NaN,139
2867,Color,Je-kyu Kang,86.0,148.0,16.0,489.0,Bin Won,717.0,1110186.0,Action|Drama|War,...,224.0,Korean,South Korea,R,1.280000e+07,2004.0,517.0,8.1,2.35,0
3191,Color,Taedong Park,8.0,85.0,0.0,196.0,Tom Arnold,1000.0,NaN,Adventure|Animation,...,2.0,English,South Korea,NaN,1.000000e+07,2014.0,618.0,4.8,NaN,186
3198,Color,Jee-woon Kim,152.0,135.0,419.0,7.0,Woo-sung Jung,398.0,128486.0,Action|Adventure|Comedy|Western,...,74.0,Korean,South Korea,R,1.000000e+07,2008.0,149.0,7.3,2.35,0
3252,Color,Hong-jin Na,77.0,156.0,43.0,0.0,Jun Kunimura,45.0,770629.0,Fantasy|Horror|Mystery|Thriller,...,24.0,Korean,South Korea,Not Rated,NaN,2016.0,5.0,7.7,2.35,0
3284,Color,Woo-Suk Kang,15.0,135.0,0.0,13.0,Sung-kee Ahn,28.0,NaN,Action|Drama,...,17.0,Korean,South Korea,NaN,8.000000e+06,2003.0,15.0,7.2,2.35,387
3787,Color,Chan-wook Park,202.0,112.0,0.0,38.0,Yeong-ae Lee,717.0,211667.0,Crime|Drama,...,131.0,Korean,South Korea,R,4.200000e+09,2005.0,126.0,7.7,2.35,4000
4023,Color,Chan-wook Park,305.0,120.0,0.0,38.0,Ji-tae Yu,717.0,2181290.0,Drama|Mystery|Thriller,...,809.0,Korean,South Korea,R,3.000000e+06,2003.0,78.0,8.4,2.35,43000

**Exercise 31**: Select movies whose `gross` is `NaN`.

In [181]:
# hint: isnull(), boolean indexing
movie.query('gross == "NaN"')
movie[movie.gross.isnull()]

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
84,Color,Roland Joffé,10.0,109.0,596.0,283.0,Alice Englert,622.0,NaN,Action|Adventure|Romance|Sci-Fi,...,15.0,English,Belgium,R,NaN,2015.0,525.0,4.5,NaN,677
98,Color,Hideaki Anno,1.0,120.0,28.0,12.0,Shin'ya Tsukamoto,544.0,NaN,Action|Adventure|Drama|Horror|Sci-Fi,...,13.0,Japanese,Japan,NaN,NaN,2016.0,106.0,8.2,2.35,0
176,Color,NaN,21.0,60.0,NaN,184.0,Philip Michael Thomas,982.0,NaN,Action|Crime|Drama|Mystery|Thriller,...,74.0,English,USA,TV-14,1500000.0,NaN,321.0,7.5,1.33,0
197,Color,Matt Birch,1.0,NaN,0.0,159.0,Dave Legeno,10000.0,NaN,Action|Fantasy,...,2.0,English,UK,NaN,NaN,2011.0,570.0,7.5,NaN,40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4905,Color,Ash Baron-Cohen,10.0,98.0,3.0,152.0,Stanley B. Herman,789.0,NaN,Crime|Drama,...,14.0,English,USA,NaN,NaN,1995.0,194.0,6.4,NaN,20
4909,Color,Anthony Vallone,NaN,84.0,2.0,2.0,John Considine,45.0,NaN,Crime|Drama,...,1.0,English,USA,PG-13,3250.0,2005.0,44.0,7.8,NaN,4
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16

**Exercise 32**: Add up all the actor and director Facebook likes and assign them to the new `actor_director_facebook_likes` column.

In [25]:
movie1 = movie.copy()
movie1['actor_director_facebook_likes'] = movie['director_facebook_likes'] + movie['actor_2_facebook_likes'] + movie['actor_1_facebook_likes'] + movie['actor_3_facebook_likes']
movie1

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes,actor_director_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000,2791.0
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0,46563.0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000,11554.0
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000,95000.0
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84,1427.0
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000,NaN
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16,0.0
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660,2154.0
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456,141.0

**Exercise 33**: Who produces more good rated movies, Steven Spielberg or James Cameron? Select the `director_name` column, but only  when said `director_name` is one of those two options, _and_ the `imdb_score` column is greater than or equal to 8.0.

In [27]:
movie['imdb_score'] > 8.0

0       False
1       False
2       False
3        True
4       False
        ...
4911    False
4912    False
4913    False
4914    False
4915    False
Name: imdb_score, Length: 4916, dtype: bool

이번주도 10~11시 office hour 운영 된다.

<font color = "#CC3D3D"><p>
# End